; domain
(define (domain problem2)

    (:requirements :strips :typing)

    (:types
        location
        workstation
        robot
        carrier
        box
        content
        number
    )

    (:constants
        central_warehouse - location
        zero one two three four five six seven eight nine ten - number
    )

    (:predicates
        (adjacent ?l1 - location ?l2 - location)
        
        (walks ?r - robot)
        (flies ?r - robot)
        (jumps ?r - robot)

        (carrier_capacity ?c - carrier ?n - number)
        (increase_capacity ?n - number ?m - number)
        (decrease_capacity ?n - number ?m - number)

        (workstation_at_location ?w - workstation ?l - location)
        (robot_at_location ?r - robot ?l - location)
        (carrier_at_location ?c - carrier ?l - location)
        (box_at_location ?b - box ?l - location)
        (content_at_location_at_workstation ?c - content ?l - location ?w - workstation)
        (content_at_cw ?c - content)


        (robot_has_carrier ?r - robot ?c - carrier)
        (carrier_has_box ?c - carrier ?b - box)
        (box_has_content ?b - box ?c - content)

        (robot_is_attached ?r - robot)
        (carrier_is_attached ?c - carrier)
        (box_is_loaded ?b - box)
        (box_is_full ?b - box)
    )

    (:action move_walking
        :parameters(
            ?r - robot
            ?from - location
            ?to - location
        )
        :precondition(and
            (walks ?r)
            (robot_at_location ?r ?from)
            (adjacent ?from ?to)
        )
        :effect(and
            (not(robot_at_location ?r ?from))
            (robot_at_location ?r ?to)
        )
    )

    (:action move_flying
        :parameters(
            ?r - robot
            ?from - location
            ?to - location
        )
        :precondition(and
            (flies ?r)
            (robot_at_location ?r ?from)
        )
        :effect(and
            (not(robot_at_location ?r ?from))
            (robot_at_location ?r ?to)
        )
    )

    (:action move_jumping
        :parameters(
            ?r - robot
            ?from - location
            ?half - location
            ?to - location
        )
        :precondition(and
            (jumps ?r)
            (robot_at_location ?r ?from)
            (adjacent ?from ?half)
            (adjacent ?half ?to)
            (not (robot_at_location ?r ?to))
        )
        :effect(and
            (not(robot_at_location ?r ?from))
            (robot_at_location ?r ?to)
        )
    )

    (:action robot_attach_carrier
        :parameters (
            ?r - robot
            ?c - carrier
            ?l - location
        )
        :precondition(and
            (robot_at_location ?r ?l)
            (carrier_at_location ?c ?l)
            (not(robot_has_carrier ?r ?c))
            (not(robot_is_attached ?r))
            (not(carrier_is_attached ?c))
        )
        :effect(and
            (robot_has_carrier ?r ?c)
            (robot_is_attached ?r)
            (carrier_is_attached ?c)
            (not (carrier_at_location ?c ?l))
        )
    )

    (:action robot_detach_carrier
        :parameters (
            ?r - robot
            ?c - carrier
            ?l - location
        )
        :precondition(and
            (robot_at_location ?r ?l)
            (robot_has_carrier ?r ?c)
            (robot_is_attached ?r)
            (carrier_is_attached ?c)
        )
        :effect(and
            (not(robot_has_carrier ?r ?c))
            (not(robot_is_attached ?r))
            (not(carrier_is_attached ?c))
            (carrier_at_location ?c ?l)
        )
    )

    (:action robot_load_box
        :parameters (
            ?r - robot
            ?c - carrier
            ?b - box
            ?l - location
            ?n - number
            ?m - number
        )
        :precondition (and 
            (robot_at_location ?r ?l)
            (robot_has_carrier ?r ?c)
            (carrier_is_attached ?c)
            (box_at_location ?b ?l)
            (not (box_is_loaded ?b))
            (not (carrier_has_box ?c ?b))
            (carrier_capacity ?c ?n)
            (decrease_capacity ?n ?m)
        )
        :effect (and 
            (box_is_loaded ?b)
            (carrier_has_box ?c ?b)
            (not (box_at_location ?b ?l))
            (not (carrier_capacity ?c ?n))
            (carrier_capacity ?c ?m)
        )
    )

    (:action robot_unload_box
        :parameters (
            ?r - robot
            ?c - carrier
            ?b - box
            ?l - location
            ?n - number
            ?m - number
        )
        :precondition (and 
            (robot_at_location ?r ?l)
            (robot_has_carrier ?r ?c)
            (carrier_is_attached ?c)
            (box_is_loaded ?b)
            (carrier_has_box ?c ?b)
            (carrier_capacity ?c ?n)
            (increase_capacity ?n ?m)
        )
        :effect (and 
            (not (box_is_loaded ?b))
            (not (carrier_has_box ?c ?b))
            (box_at_location ?b ?l)
            (not (carrier_capacity ?c ?n))
            (carrier_capacity ?c ?m)
        )
    )

    (:action pick_up_content_at_cw
        :parameters (
            ?r - robot
            ?con - content
            ?car - carrier
            ?b - box
        )
        :precondition (and 
            (robot_at_location ?r central_warehouse)
            (content_at_cw ?con)
            (robot_has_carrier ?r ?car)
            (carrier_is_attached ?car)
            (carrier_has_box ?car ?b)
            (box_is_loaded ?b)
            (not (box_is_full ?b))
        )
        :effect (and 
            (box_has_content ?b ?con)
            (box_is_full ?b)
        )
    )

    (:action put_down_content_at_cw
        :parameters (
            ?r - robot
            ?con - content
            ?car - carrier
            ?b - box
        )
        :precondition (and 
            (robot_at_location ?r central_warehouse)
            (content_at_cw ?con)
            (robot_has_carrier ?r ?car)
            (carrier_is_attached ?car)
            (carrier_has_box ?car ?b)
            (box_is_loaded ?b)
            (box_has_content ?b ?con)
            (box_is_full ?b)
        )
        :effect (and 
            (not (box_has_content ?b ?con))
            (not (box_is_full ?b))
        )
    )

    (:action pick_up_content
        :parameters (
            ?r - robot
            ?car - carrier
            ?b - box
            ?con - content
            ?l - location
            ?w - workstation
        )
        :precondition (and
            (robot_at_location ?r ?l)
            (workstation_at_location ?w ?l)
            (robot_has_carrier ?r ?car)
            (robot_is_attached ?r)
            (carrier_is_attached ?car)
            (carrier_has_box ?car ?b)
            (box_is_loaded ?b)
            (not (box_is_full ?b))
            (content_at_location_at_workstation ?con ?l ?w)
        )
        :effect (and
            (box_has_content ?b ?con)
            (box_is_full ?b)
            (not (content_at_location_at_workstation ?con ?l ?w))
        )
    )

    (:action put_down_content
        :parameters (
            ?r - robot
            ?car - carrier
            ?b - box
            ?con - content
            ?l - location
            ?w - workstation
        )
        :precondition (and
            (robot_at_location ?r ?l)
            (workstation_at_location ?w ?l)
            (robot_has_carrier ?r ?car)
            (robot_is_attached ?r)
            (carrier_is_attached ?car)
            (carrier_has_box ?car ?b)
            (box_is_loaded ?b)
            (box_has_content ?b ?con)
            (box_is_full ?b)
        )
        :effect (and
            (not (box_has_content ?b ?con))
            (not (box_is_full ?b))
            (content_at_location_at_workstation ?con ?l ?w)
        )
    )
)

; problem
(define (problem problem_1)
    (:domain problem2)

    (:objects
        loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 - location
        wor1_1 wor6_1 wor8_1 - workstation
        walker jumper - robot
        carrier1 carrier2 - carrier
        box1 box2 box3 - box
        tool bolt valve - content
    )

    (:init
        (walks walker)
        (jumps jumper)

        (adjacent central_warehouse loc1)
        (adjacent loc1 central_warehouse)
        (adjacent loc1 loc2)
        (adjacent loc2 loc1)
        (adjacent loc2 loc3)
        (adjacent loc3 loc2)
        (adjacent loc3 loc4)
        (adjacent loc4 loc3)
        (adjacent loc4 loc5)
        (adjacent loc5 loc4)
        (adjacent loc5 loc6)
        (adjacent loc6 loc5)
        (adjacent loc6 loc7)
        (adjacent loc7 loc6)
        (adjacent loc7 loc8)
        (adjacent loc8 loc7)

        (workstation_at_location wor1_1 loc1)
        (workstation_at_location wor6_1 loc6)
        (workstation_at_location wor8_1 loc8)

        (robot_at_location walker central_warehouse)
        (robot_at_location jumper central_warehouse)

        (carrier_capacity carrier1 one)
        (carrier_capacity carrier2 two)
        (carrier_at_location carrier1 central_warehouse)
        (carrier_at_location carrier2 central_warehouse)

        (box_at_location box1 central_warehouse)
        (box_at_location box2 central_warehouse)
        (box_at_location box3 central_warehouse)

        (content_at_cw tool)
        (content_at_cw bolt)
        (content_at_cw valve)

        (increase_capacity zero one)
        (increase_capacity one two)
        (increase_capacity two three)
        (increase_capacity three four)
        (increase_capacity four five)
        (increase_capacity five six)
        (increase_capacity six seven)
        (increase_capacity seven eight)
        (increase_capacity eight nine)
        (increase_capacity nine ten)
        (decrease_capacity one zero)
        (decrease_capacity two one)
        (decrease_capacity three two)
        (decrease_capacity four three)
        (decrease_capacity five four)
        (decrease_capacity six five)
        (decrease_capacity seven six)
        (decrease_capacity eight seven)
        (decrease_capacity nine eight)
        (decrease_capacity ten nine)
    )
    
    (:goal
        (and
            (content_at_location_at_workstation valve loc1 wor1_1)
            (content_at_location_at_workstation tool loc6 wor6_1)
            (content_at_location_at_workstation tool loc8 wor8_1)
        )
    )
)

; plan
1. (robot_attach_carrier walker carrier1 central_warehouse)
   deleted: (carrier_at_location carrier1 central_warehouse)
   added: (robot_has_carrier walker carrier1) (robot_is_attached walker) (carrier_is_attached carrier1)
   goals met: 0 of 3
2. (robot_load_box walker carrier1 box1 central_warehouse one zero)
   deleted: (box_at_location box1 central_warehouse) (carrier_capacity carrier1 one)
   added: (box_is_loaded box1) (carrier_has_box carrier1 box1) (carrier_capacity carrier1 zero)
   goals met: 0 of 3
3. (pick_up_content_at_cw walker valve carrier1 box1)
   added: (box_has_content box1 valve) (box_is_full box1)
   goals met: 0 of 3
4. (move_walking walker central_warehouse loc1)
   deleted: (robot_at_location walker central_warehouse)
   added: (robot_at_location walker loc1)
   goals met: 0 of 3
5. (put_down_content walker carrier1 box1 valve loc1 wor1_1)
   deleted: (box_has_content box1 valve) (box_is_full box1)
   added: (content_at_location_at_workstation valve loc1 wor1_1)
   goals met: 1 of 3
6. (robot_attach_carrier jumper carrier2 central_warehouse)
   deleted: (carrier_at_location carrier2 central_warehouse)
   added: (robot_has_carrier jumper carrier2) (robot_is_attached jumper) (carrier_is_attached carrier2)
   goals met: 1 of 3
7. (robot_load_box jumper carrier2 box2 central_warehouse two one)
   deleted: (box_at_location box2 central_warehouse) (carrier_capacity carrier2 two)
   added: (box_is_loaded box2) (carrier_has_box carrier2 box2) (carrier_capacity carrier2 one)
   goals met: 1 of 3
8. (pick_up_content_at_cw jumper tool carrier2 box2)
   added: (box_has_content box2 tool) (box_is_full box2)
   goals met: 1 of 3
9. (robot_load_box jumper carrier2 box3 central_warehouse one zero)
   deleted: (box_at_location box3 central_warehouse) (carrier_capacity carrier2 one)
   added: (box_is_loaded box3) (carrier_has_box carrier2 box3) (carrier_capacity carrier2 zero)
   goals met: 1 of 3
10. (pick_up_content_at_cw jumper tool carrier2 box3)
   added: (box_has_content box3 tool) (box_is_full box3)
   goals met: 1 of 3
11. (move_jumping jumper central_warehouse loc1 loc2)
   deleted: (robot_at_location jumper central_warehouse)
   added: (robot_at_location jumper loc2)
   goals met: 1 of 3
12. (move_jumping jumper loc2 loc3 loc4)
   deleted: (robot_at_location jumper loc2)
   added: (robot_at_location jumper loc4)
   goals met: 1 of 3
13. (move_jumping jumper loc4 loc5 loc6)
   deleted: (robot_at_location jumper loc4)
   added: (robot_at_location jumper loc6)
   goals met: 1 of 3
14. (put_down_content jumper carrier2 box2 tool loc6 wor6_1)
   deleted: (box_has_content box2 tool) (box_is_full box2)
   added: (content_at_location_at_workstation tool loc6 wor6_1)
   goals met: 2 of 3
15. (move_jumping jumper loc6 loc7 loc8)
   deleted: (robot_at_location jumper loc6)
   added: (robot_at_location jumper loc8)
   goals met: 2 of 3
16. (put_down_content jumper carrier2 box3 tool loc8 wor8_1)
   deleted: (box_has_content box3 tool) (box_is_full box3)
   added: (content_at_location_at_workstation tool loc8 wor8_1)
   goals met: 3 of 3
